Revit 2027 API
RevitLinkOperations.SetGetLocalPathForOpenCallback Method
 Sets the IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command for Revit links obtained from an IExternalResourceServer.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetGetLocalPathForOpenCallback(
	IGetLocalPathForOpenCallback makeLocalCopyForOpen
)
Public Sub SetGetLocalPathForOpenCallback (
	makeLocalCopyForOpen As IGetLocalPathForOpenCallback
)
public:
void SetGetLocalPathForOpenCallback(
	IGetLocalPathForOpenCallback^ makeLocalCopyForOpen
)
member SetGetLocalPathForOpenCallback :
        makeLocalCopyForOpen : IGetLocalPathForOpenCallback -> unit
Parameters
makeLocalCopyForOpen IGetLocalPathForOpenCallback
 The IGetLocalPathForOpenCallback that will support the "Open (and Unload)" command.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RevitLinkOperations Class
Autodesk.Revit.DB Namespace